# GetDefaultServerId Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ExternalService..::..GetDefaultServerId Method
ExternalService Class See Also
---
Returns the Id of the default server if one was assigned to the service.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Guid GetDefaultServerId()
```

Visual Basic
---
```text
Public Function GetDefaultServerId As Guid
```

Visual C++
---
```text
public:
Guid GetDefaultServerId()
```

# ### Return Value
The GUID of the default server, or an invalid GUID if there is none assigned.
# Remarks
Only mandatory services have default servers assigned. Only built-in service can currently be mandatory. All third-party services are optional and cannot (amd may not) have default servers.
# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace